1c/Catalogs/leads.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>leads</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>lead_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.source</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>stage</Name>
					<Type>
						<v8:Type>cfg:EnumRef.current_stage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>owner_fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/Catalogs/leads/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
    // Проверка заполненности
    Если ПустаяСтрока(lead_id)или ПустаяСтрока(source)или ПустаяСтрока(stage)или ПустаяСтрока(owner_fio)или ПустаяСтрока(created_at)Тогда
        //Сообщить("все поля обязательны для заполнения.");
        Отказ = Истина;
        Возврат;
	КонецЕсли;
	
	// проверка существования значений           
	
// Если в current_stage попала строка (например, "won"), преобразуем её
//	Если ТипЗнч(current_stage) = Тип("Строка") Тогда
//		
//		ИмяСтадии = СокрЛП(current_stage); // убираем пробелы
//		
//		Попытка
//			// Собираем путь к значению: "Перечисление.ИмяПеречисления.ИмяЗначения"
//			ПутьКЗначению = "Перечисление.current_stage." + ИмяСтадии;
//			ЭтотОбъект.current_stage = ПредопределенноеЗначение(ПутьКЗначению);
//		Исключение
//			// Если в строке пришло что-то, чего нет в Конфигураторе (например "super_won")
//			Сообщить("Ошибка: Стадия '" + ИмяСтадии + "' не найдена в метаданных 1С!");
//			Отказ = Истина;
//		КонецПопытки;
//		
//	КонецЕсли;
КонецПроцедуры
